[
  {
    "id": "kb-canva-dashboard",
    "title": "Gestão Canva - visão geral do painel",
    "content": "O componente CanvaDashboard.tsx concentra as métricas oficiais sincronizadas via store useSchoolLicenseStore. A tela abre com cards de estatísticas (total de usuários, conformidade, escolas e tickets) e um seletor de período (30d, 3m, 6m, 12m) que atualiza os dados. Há botões para exportar CSV e recarregar dados oficiais (loadOfficialData). Os dados alimentam abas Overview/Distribuição/Usuários/Custos/Auditoria e cada aba usa subcomponentes como CanvaUsageDashboard, CostManagementDashboard e SchoolLicenseManagement. Use esse contexto para responder sobre métricas agregadas do Canva, explicar como exportar relatórios ou como funciona o auto refresh (hook useAutoRefresh a cada 5 min).",
    "category": "canva",
    "tags": ["dashboard", "canva", "sincronizacao", "metricas"],
    "status": "ativo",
    "priority": "alta",
    "createdAt": "2025-11-17T12:00:00Z",
    "updatedAt": "2025-11-17T12:00:00Z",
    "createdBy": "Sistema",
    "usageCount": 0
  },
  {
    "id": "kb-licencas-usuarios",
    "title": "Gestão de licenças por escola e usuários",
    "content": "SchoolLicenseManagement.tsx permite filtrar escolas por nome, cluster, status de licença (Disponível/Completo/Excedido) e função dos usuários. Os dados vêm de useSchoolLicenseStore, que calcula estatísticas de domínios não MapleBear, usuários não conformes e permite operações como swapUser, transferUsersBetweenSchools e histórico de justificativas. Há exportação CSV dos filtros ativos e importador CSV com pré-visualização. Essa tela é usada quando o atendimento pede dados de uma escola específica (capacidade, usuários alocados, status).",
    "category": "canva",
    "tags": ["licencas", "usuarios", "clusters", "csv"],
    "status": "ativo",
    "priority": "alta",
    "createdAt": "2025-11-17T12:05:00Z",
    "updatedAt": "2025-11-17T12:05:00Z",
    "createdBy": "Sistema",
    "usageCount": 0
  },
  {
    "id": "kb-vouchers-dashboard",
    "title": "Dashboard de vouchers e exceções",
    "content": "VoucherDashboard.tsx carrega loadVoucherData e exibe escolas elegíveis, envio de vouchers e exceções cadastradas (objects ExceptionVoucher). Há filtros por cluster, status, envio e busca textual. O componente mostra stats (total de escolas, taxa de elegibilidade, vouchers enviados) e permite gerar relatório PDF ou exportar CSV via exportVoucherReport. Use esta entrada para responder perguntas sobre distribuição de vouchers 2025/2026, clusters com maior fila ou como filtrar exceções.",
    "category": "vouchers",
    "tags": ["vouchers", "excecoes", "relatorios"],
    "status": "ativo",
    "priority": "media",
    "createdAt": "2025-11-17T12:10:00Z",
    "updatedAt": "2025-11-17T12:10:00Z",
    "createdBy": "Sistema",
    "usageCount": 0
  },
  {
    "id": "kb-tickets-operacao",
    "title": "Operação de tickets SAF",
    "content": "TicketsPage.tsx usa o store useTicketStore e permite alternar entre visualização Kanban (TicketKanban) e Tabela (TicketTable). Há filtros por status, agente responsável e busca por ID/observação, além de atalhos de teclado (N, K, T). Os cards exibem totais por status e agentes autorizados (permissão Agent) podem abrir TicketDialog para novos chamados. A IA deve citar esses recursos quando perguntarem sobre SLAs, etapas ou como registrar um ticket.",
    "category": "tickets",
    "tags": ["kanban", "tabela", "filtros", "atalhos"],
    "status": "ativo",
    "priority": "media",
    "createdAt": "2025-11-17T12:15:00Z",
    "updatedAt": "2025-11-17T12:15:00Z",
    "createdBy": "Sistema",
    "usageCount": 0
  },
  {
    "id": "kb-monitoring-portal",
    "title": "Portal de monitoria e pendências",
    "content": "MonitoringPortal.tsx concentra o acompanhamento diário de tickets críticos. Os dados mockados trazem campos número, responsável, dias pendente e histórico. É possível filtrar por status, buscar por responsável/observação e abrir diálogos para criar tickets ou atualizar status. Use o Card com badges (Pendente, Resolvido, Em andamento) para justificar respostas sobre backlog, responsáveis e histórico das pendências do SAF.",
    "category": "monitoria",
    "tags": ["monitoria", "pendencias", "alertas"],
    "status": "ativo",
    "priority": "baixa",
    "createdAt": "2025-11-17T12:18:00Z",
    "updatedAt": "2025-11-17T12:18:00Z",
    "createdBy": "Sistema",
    "usageCount": 0
  },
  {
    "id": "kb-insights-analytics",
    "title": "Insights analíticos unificados",
    "content": "InsightsAnalytics.tsx gera mockData para vouchers, usuários Canva e performance por cluster. O usuário escolhe período (7d, 30d, 90d, 1y) e métrica (vouchers, usuários, escolas) para atualizar os cards e gráficos. Há botões de exportação e badges com distribuição por função. Contexto útil para responder sobre tendências, crescimento e comparativos históricos do SAF.",
    "category": "insights",
    "tags": ["analytics", "tendencias", "periodo"],
    "status": "ativo",
    "priority": "media",
    "createdAt": "2025-11-17T12:20:00Z",
    "updatedAt": "2025-11-17T12:20:00Z",
    "createdBy": "Sistema",
    "usageCount": 0
  },
  {
    "id": "kb-auth-header",
    "title": "Login, papéis e avatar do header",
    "content": "Login.tsx autentica com login/saveAuthToken/saveUser, salva userEmail no localStorage e configura o estado global via useAuthStore com mapRole (Admin/Coordinator/Agent, padrão Agent). Após autenticar exibe toast e redireciona para /dashboard. O Header lê userEmail para montar iniciais do avatar e mostra o item Gerenciamento somente para Admin; o dropdown também leva para Base de Conhecimento e faz logout via authService.logout + toast.",
    "category": "onboarding",
    "tags": ["login", "auth", "papéis", "header", "avatar"],
    "status": "ativo",
    "priority": "alta",
    "createdAt": "2025-11-17T12:25:00Z",
    "updatedAt": "2025-11-17T12:25:00Z",
    "createdBy": "Sistema",
    "usageCount": 0
  },
  {
    "id": "kb-dashboard-home",
    "title": "Tela inicial com atalhos e painel Canva embutido",
    "content": "Index.tsx traz a home com cards rápidos (Painel Canva, Tickets, Base de Conhecimento) e estatísticas destacadas. A seção \"Painel completo, já na tela inicial\" renderiza CanvaDashboard dentro da própria home, com CTA para abrir em tela cheia. Há botões para navegar às rotas /dashboard/canva, /tickets e /knowledge-base e o FloatingAIChat fica disponível no rodapé para consultas rápidas.",
    "category": "dashboard",
    "tags": ["home", "atalhos", "canva", "tickets", "conhecimento", "ia"],
    "status": "ativo",
    "priority": "media",
    "createdAt": "2025-11-17T12:27:00Z",
    "updatedAt": "2025-11-17T12:27:00Z",
    "createdBy": "Sistema",
    "usageCount": 0
  },
  {
    "id": "kb-agenda-saf",
    "title": "Agenda SAF mensal e eventos",
    "content": "AgendaSafPage.tsx exibe calendário mensal com navegação por mês e lista de eventos do dia selecionado. Os eventos são carregados por React Query (queryKey [\"agenda-events\", mês]) via fetchEvents e gravados com createEvent/updateEvent/deleteEvent. NovoEventoModal abre para criar/editar; cada card mostra horário formatado, tipo, criador e botões de editar/remover; toasts notificam sucesso ou erro.",
    "category": "agenda",
    "tags": ["eventos", "calendario", "react-query", "modal", "toasts"],
    "status": "ativo",
    "priority": "media",
    "createdAt": "2025-11-17T12:30:00Z",
    "updatedAt": "2025-11-17T12:30:00Z",
    "createdBy": "Sistema",
    "usageCount": 0
  },
  {
    "id": "kb-knowledge-base",
    "title": "Base de conhecimento e prompts da IA",
    "content": "KnowledgeBasePage.tsx carrega AIKnowledgeBase com abas \"Base de Conhecimento\" e \"Prompts da IA\". Os artigos ficam no localStorage (chave saf_knowledge_base) e são semeados por public/knowledge-base/default_knowledge.json na primeira carga. Uploads de .txt/.md/.csv/.json viram artigos (categoria \"documentos\" por padrão) e prompts ficam em saf_ai_prompts. O FloatingAIChat usa buildKnowledgeSummaries + subscribeToKnowledgeBase para anexar esse contexto às respostas.",
    "category": "conhecimento",
    "tags": ["knowledge-base", "ia", "prompts", "upload", "localStorage"],
    "status": "ativo",
    "priority": "alta",
    "createdAt": "2025-11-17T12:32:00Z",
    "updatedAt": "2025-11-17T12:32:00Z",
    "createdBy": "Sistema",
    "usageCount": 0
  }
]
